#define AT24C08_H
#ifdef AT24C08_H

#define AT24C08_PAGE0	0xA0
#define AT24C08_PAGE1	0xA2
#define AT24C08_PAGE2	0xA4
#define AT24C08_PAGE3	0xA8

#define SET_AT24C08_SDA_OUT      {P0MDL &= 0x3F; P0MDL |= 0x80;}
#define SET_AT24C08_SDA_IN       {P0MDL &= 0x3F; P0MDL |= 0x40;}
/*-------------------------------------------------------------------------
*函数：initAt24c08  存储器初使化
*参数：无  
*返回值：无
*-------------------------------------------------------------------------*/
void initAt24c08(void);

/*-------------------------------------------------------------------------
*函数：eepromWriteByte  向存储器是写字
*参数：page 存储器页   addr 存储器地址  value 写入的值 
*返回值：无
*-------------------------------------------------------------------------*/
void eepromWriteByte(u8 page,u8 addr,u8 value);
/*-------------------------------------------------------------------------
*函数：eepromWritePage  存储器写入
*参数：无  
*返回值：无
*-------------------------------------------------------------------------*/
void eepromWritePage(u8 page,u8 *p_value, u8 addr, u8 len);
/*-------------------------------------------------------------------------
*函数：eepromReadByte  读存储器
*参数：无  
*返回值：所读的值
*-------------------------------------------------------------------------*/
u8 eepromReadByte(u8 page,u8 addr);
/*-------------------------------------------------------------------------
*函数：eepromReadSequential  读存储器
*参数：无  
*返回值：无
*-------------------------------------------------------------------------*/
void eepromReadSequential(u8 page,u8 *p_data,u8 addr,u8 length);

#endif